# Introduction

In this NoteBook, we will clean the dataset of EV sales in different states from 2016-2019.

# Set up

In [13]:
import pandas as pd

### Read the data

In [14]:
#read the data file, skip the third row and rows contain 'mean' and 'median' 
data = pd.read_csv('../Raw_Data/EV_sales_by_state_2016-2019.csv', skiprows=[0,2,54,55,56], delimiter = ',')

In [15]:
data.head()

   Unnamed: 0    2016    2017     2018     2019
0  California  73,854  94,873  153,442  145,020
1    New York   6,043  10,090   15,752   14,823
2  Washington   5,363   7,068   12,650   12,172
3     Florida   6,255   6,573   13,705   15,794
4       Texas   4,510   5,419   11,764    5,780

In [16]:
type(data.iloc[0,1])

str

#### We find that, the type of data are string, we need int type.

In [17]:
data["2016"] = pd.to_numeric(data["2016"].str.replace(',', ''))
data["2017"] = pd.to_numeric(data["2017"].str.replace(',', ''))
data["2018"] = pd.to_numeric(data["2018"].str.replace(',', ''))
data["2019"] = pd.to_numeric(data["2019"].str.replace(',', ''))

In [18]:
data.head()

   Unnamed: 0   2016   2017    2018    2019
0  California  73854  94873  153442  145020
1    New York   6043  10090   15752   14823
2  Washington   5363   7068   12650   12172
3     Florida   6255   6573   13705   15794
4       Texas   4510   5419   11764    5780

In [19]:
data = data.rename(columns={'Unnamed: 0':'State'})
data.head()

        State   2016   2017    2018    2019
0  California  73854  94873  153442  145020
1    New York   6043  10090   15752   14823
2  Washington   5363   7068   12650   12172
3     Florida   6255   6573   13705   15794
4       Texas   4510   5419   11764    5780

In [20]:
# Now we have cleanned data, save it into processed file
path = '../Processed_Data/Ev_sales.csv'
data.to_csv(path)